Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/types_of_employment/self_employment/closing_or_selling_a_business_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Closing or selling a business
ga: Gnó a dhúnadh nó a dhíol

source: • Employees and closing a business
ga: • Fostaithe agus gnó a dhúnadh

source: There are many issues facing a business owner who is considering or facing a business closure or transfer
ga: Tá neart ceisteanna le freagairt ag úinéir gnó a bhfuil dúnadh gnó nó aistriú gnó os a c(h)omhair

source: This document aims to provide you with high-level information on these issues and links to more detailed information to help guide you through this process
ga: Tá sé mar chuspóir ag an gcáipéis seo eolas den scoth a chur ar fáil duit faoi na ceisteanna seo agus nascanna a chur ar fáil do mhioneolas chun treoir a thabhairt duit tríd an bpróiseas seo

source: If you are a sole trader the process is quite straightforward
ga: Más trádálaí aonair thú, níl an próiseas casta in aon chor

source: You simply cease trading and inform your clients and suppliers that you are no longer in business
ga: Níl ort ach stop a chur leis an trádáil agus do chuid cliant agus soláthróirí a chur ar an eolas nach mbeidh tú i mbun gnó a thuilleadh

source: You need to retain financial and other records for 6 years following closure
ga: Is gá duit taifid airgeadais agus eile a choimeád ar feadh 6 bliana i ndiaidh an dúnta

source: If you use a business name you must inform the Companies Registration Office that you have ceased trading within 3 months
ga: Má úsáideann tú ainm gnó, ní mór duit an Oifig um Chlárú Cuideachtaí a chur ar an eolas gur stop tú leis an trádáil laistigh de 3 mhí

source: You do this using Form RBN3 (pdf)
ga: Déanann tú seo trí leas a bhaint as Foirm RBN3 (pdf)

source: You can cancel your tax and VAT registration with Revenue by filling out a Tax Registration Cancellation Notification (form TRCN1)(pdf)
ga: Is féidir leat do chlárú cánach agus CBL a chealú leis na Coimisinéirí Ioncaim trí Fhógra um Chealú Clárú Cánach (foirm TRCN1) (pdf) a chomhlánú

source: If you owe debts to creditors you are personally responsible for those debts
ga: Má tá fiacha ag creidiúnaithe ort, tá tú freagrach go pearsanta as na fiacha sin

source: You can find out more in our document on problem debt
ga: Léigh níos mó inár ndoicméad faoi fhadhbanna fiachais

source: If your business is incorporated as a company you may wish to close it due to retirement or another personal reason
ga: Má tá do ghnó ionchorpraithe mar chuideachta b’fhéidir go mbeifeá ag iarraidh do ghnó a dhúnadh le dhul ar scor nó ar chúis phearsanta eile

source: Liquidation is the process of winding up a company so that it no longer exists by using its assets to pay its debts
ga: Tugtar leachtú ar an bpróiseas ina ndéantar cuideachta a fhoirceannadh le nach mbeidh sí ann a thuilleadh trí a cuid sócmhainní a úsáid chun a fiacha a ghlanadh

source: A liquidator is the person appointed to wind up the company and whose principal function is to dispose of the company’s assets, pay or settle its debts and distribute any surplus to its members
ga: Is leachtaitheoir an duine a cheaptar leis an gcuideachta a fhoirceannadh agus ag a bhfuil sé de phríomhfheidm sócmhainní na cuideachta a dhiúscairt, a cuid fiach a íoc nó a réiteach agus aon bharrachas a leithdháileadh dá cuid ball

source: When a company is in liquidation, the liquidator usually takes over the powers of the directors
ga: Nuair atá cuideachta á leachtú, is gnách gurb é an leachtaitheoir a ghlacann cumhachtaí na stiúrthóirí

source: There are 2 types of voluntary liquidation as follows:
ga: Tá 2 chineál leachtú deonach ann. Is iad sin ná:

source: • Members’ voluntary liquidation: This is when the members of a company that can pay its debts decide to wind it up
ga: • Leachtú deonach na mBall: Seo nuair a dhéanann baill cuideachta atá in ann a fiacha a ghlanadh cinneadh í a fhoirceannadh

source: Part of this process is that a majority of the business directors must make a declaration of solvency
ga: Mar chuid den phróiseas ní mór do thromlach de stiúrthóirí na cuideachta dearbhú sócmhainneachta a dhéanamh

source: This declaration means that they have enquired into the affairs of the company and believe that it would be able to pay its debts within a certain period
ga: Ciallaíonn an dearbhú seo go bhfuil fiosrú déanta acu ar ghnóthaí na cuideachta agus go gcreideann siad go mbeidh sí in ann a fiacha a ghlanadh laistigh de thréimhse áirithe

source: • Creditors’ voluntary liquidation: This is when a company is unable to pay its debts when they are due
ga: • Leachtú deonach na gCreidiúnaithe: Seo nuair nach bhfuil cuideachta in ann a fiacha a íoc nuair a bhíonn siad dlite

source: Sometimes this happens when a members’ voluntary liquidation is converted into a creditors’ voluntary liquidation
ga: Uaireanta tarlaíonn sé seo nuair a dhéantar leachtú deonach na mball a athrú go leachtú deonach na gcreidiúnaithe

source: In other cases, it is when the members of a company decide that the company’s debts are such that it should be dissolved as a creditors’ voluntary liquidation
ga: I gcásanna eile, tarlaíonn sé nuair a shocraíonn baill cuideachta gur chóir, de bharr fiacha na cuideachta, í a dhíscaoileadh mar leachtú deonach na gcreidiúnaithe

source: Involuntary liquidation means that a company is wound up by the court
ga: Ciallaíonn leachtú neamhdheonach go ndéanann an chúirt cuideachta a fhoirceannadh

source: This happens mainly at the initiation of any member or creditor of the company
ga: Go hiondúil, tarlaíonn sé seo tar éis do bhall nó do chreidiúnaí ar bith sa chuideachta é a thionscnamh

source: In some circumstances, it can happen by order of the Minister for Jobs, Enterprise and Innovation
ga: I gcásanna áirithe, is féidir leis tarlú ar ordú ón Aire Post, Fiontar agus Nuálaíochta

source: The court appoints the liquidator and supervises the liquidation process
ga: Ceapann an chúirt leachtaitheoir agus déanann sí maoirseacht ar an bpróiseas leachtaithe

source: A receiver may be appointed by the court or when a loan agreement is being enforced
ga: D’fhéadfadh sé go gceapfadh an chúirt glacadóir, nó glacadóir a cheapadh agus comhaontú iasachta á fhorghníomhú

source: The receiver is appointed to take control of the assets of the company which have been used to secure a loan, such as a mortgage
ga: Ceaptar an glacadóir le seilbh a ghlacadh ar shócmhainní na cuideachta a úsáideadh mar urrús le haghaidh iasachta, ar nós morgáiste

source: Where a loan is secured on certain company assets the receiver sells these assets on behalf of the lender
ga: Nuair atá sócmhainní áirithe de chuid na cuideachta in úsáid mar urrús le haghaidh iasachta, díolann an glacadóir na sócmhainní seo thar ceann an iasachtóra

source: If a company goes into examinership, it means that the company's financial health is ailing, but that the company is still potentially viable
ga: Má théann cuideachta i mbun scrúdaitheoireachta, ciallaíonn sé go bhfuil cúrsaí airgeadais na cuideachta i ndroch-chaoi, ach go bhfuil seans ann i gcónaí go leanfaidh sí ar aghaidh

source: An examiner is a person appointed to a company by the Court to assess the company’s position and prepare a rescue plan for the company
ga: Scrúdaitheoir is ea an duine a cheapann an chúirt do chuideachta le seasamh na cuideachta a mheasúnú agus le plean tarrthála a réiteach don chuideachta

source: You can find more details in this information booklet (pdf) published by the Office of the Director of Corporate Enforcement
ga: Is féidir leat tuilleadh sonraí a fháil sa bileog faisnéise (pdf) a d’fhoilsigh Oifig an Stiúrthóra um Fhorfheidhmiú Corparáideach

source: There are lists of insolvent companies in liquidation on the website of the Office of the Director of Corporate Enforcement
ga: Tá liosta de chuideachtaí dócmhainneacha atá i mbun leachtaithe ar láithreán gréasáin Oifig an Stiúrthóra um Fhorfheidhmiú Corparáideach

source: Employees and closing a business
ga: Fostaithe agus gnó a dhúnadh

source: When a business is closed or transferred, the law protects the rights of employees in these circumstances
ga: Nuair a dhúntar/aistrítear gnólacht, cosnaíonn an dlí cearta fostaithe sna cúinsí seo

source: If you no longer require the services of some of your employees (because you are in financial difficulties or you are reorganising your firm) you may need to make them redundant
ga: Mura dteastaíonn seirbhísí roinnt de d’fhostaithe uait a thuilleadh (de bharr go bhfuil agat deacrachtaí airgeadais nó go bhfuil do ghnóthas á atheagrú agat) b’fhéidir go mba ghá duit iad a dhéanamh iomarcach

source: You must ensure that fair procedures are followed which include fair selection criteria, giving the employee at least 2 weeks’ notice and paying the redundancy payment due to the employee on the date of dismissal
ga: Ní mór duit a chinntiú go leantar nósanna imeachta córa: áirítear critéir áirithe roghnaithe córa, fógra ar a laghad 2 sheachtain a thabhairt do d'fhostaithe agus an íocaíocht iomarcaíochta a íoc leis an bhfostaí ar dháta na dífhostaíochta

source: Your employees may be entitled to bring a claim for unfair dismissal if they consider that they were unfairly selected for redundancy or consider that a genuine redundancy situation did not exist
ga: D’fhéadfadh do chuid fostóirí bheith i dteideal éileamh a tharraingt aníos maidir le dífhostú éagórach má shíleann siad gur roghnaíodh go héagórach iad le haghaidh iomarcaíochta nó má mheasann siad nárbh ann do chás ceart iomarcaíochta

source: The Insolvency Payments Scheme is a scheme set up to pay certain outstanding entitlements concerning the pay of an employee where employment has been terminated
ga: Is scéim í Scéim Íocaíochtaí Dócmhainneachta a cuireadh ar bun chun teidlíochtaí áirithe atá fós gan comhlíonadh a íoc nuair a cuireadh deireadh le fostaíocht

source: This is only in the instance of employer's insolvency
ga: Ní bhaineann sé seo ach le dócmhainneacht fostóra

source: The Protection of Employment Acts 1977-2007 provides that where employers are planning collective redundancies, they are obliged to supply the employees' representatives with information
ga: Faoi na hAchtanna Um Chaomhnú Fostaíochta 1977-2007 ní foláir d'fhostóirí a bhfuil pleananna comhiomarcaíochta acu eolas a chur ar fáil d'ionadaithe fostaithe

source: They must inform the representatives of specific information regarding the proposed redundancies and to consult with those representatives at least 30 days before the first dismissal takes place
ga: Ní mór dóibh eolas ar leith maidir leis na hiomarcaíochtaí atá beartaithe a chur ar fáil do na hionadaithe agus iad a phlé leo ar a laghad 30 lá roimh a tharlaíonn an chéad dífhostú

source: This is to see if the redundancies can be avoided or lessened or their effects can be mitigated
ga: Tá sé amhlaidh chun féachaint an féidir na hiomarcaíochtaí a sheachaint nó a dtorthaí a mhaolú

source: In addition the Employees (Provision of Information and Consultation) Act 2006 requires employers of 50 or more people to consult with employees on substantial changes in the workplace, including proposals for collective redundancies
ga: Éilíonn an tAcht um Fhostaithe (Faisnéis agus Comhchomhairle a Sholáthar) 2006 (pdf) ar fhostóirí atá 50 fostaithe nó níos mó acu dul i gcomhairle le d’fhostaithe i dtaobh athruithe móra na láithreach oibre, lena náirítear tograí comhiomarcaíochta

source: All eligible employees are entitled to a statutory redundancy payment when they are made redundant
ga: Tá an uile fhostaí incháilithe i dteideal iocaíocht iomarcaíochta reachtúla nuair a dhéantar iomarcach iad

source: If you pay the statutory redundancy entitlement and give proper notice of redundancy to your employees in 2012 you are entitled to a 15% rebate from the Social Insurance Fund (SIF)
ga: Má íocann tú an teidlíocht iomarcaíochta reachtúla agus má thugann tú fógra ceart iomarcaíochta do d’fostaithe i 2012, tá tú i dteideal lacáiste 15% a fháil ón gCiste Árachais Shóisialta (SIF)

source: There will be no statutory redundancy employer rebate where the date of dismissal due to redundancy is on or after 1 January 2013
ga: Ní íocfar aon lacáiste i gcás go mbristear duine as post ar chúis iomarcaíochta ar an 1 Eanáir 2013 nó dá éis

source: The European Union has created some regulations to safeguard employees' rights on transfer of undertakings
ga: Chuir an Aontas Eorpach rialacháin áirithe ar bun chun cearta fostaithe i gcás aistrithe gnóthais a chosaint

source: These safeguards are in place in Ireland and provide that the rights and obligations of the original owner arising from an employment contract relationship existing at the date of transfer shall by reason of such transfer, be transferred to the new owner (the transferee)
ga: Tá an cosaint seo i bhfeidhm in Éirinn agus forálann siad go n-aistreofar cearta agus oibleagáidí an bhunúinéara a eascraíonn as caidreamh bunaithe ar chonradh fostaíochta atá i bhfeidhm ag dáta an aistrithe go dtí an úinéir nua (an t-aistrí)
